fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачислениеПремии();
	РасчетНДФЛ();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачислениеПремии()
	
	Для Каждого Строка Из СписокСотрудников Цикл	
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Результат = Строка.СуммаПремии;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РасчетНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.Регистратор КАК Регистратор,
		|	ВКМ_Удержания.Размер КАК Размер,
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_СписокСотрудников
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник = ВКМ_Удержания.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка
		|	И ВКМ_Удержания.ВидРасчета = &НДФЛ
		|	И ВКМ_Удержания.ПериодРегистрации = &ПериодРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_СписокСотрудников.Регистратор КАК Регистратор,
		|	ВТ_СписокСотрудников.Размер КАК Размер,
		|	ВТ_СписокСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК ОсновныеНачисления
		|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
		|ИЗ
		|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, (Сотрудник,
		|			Регистратор) В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.Сотрудник КАК сотрудник,
		|				СписокСотрудников.Регистратор КАК Регистратор
		|			ИЗ
		|				Вт_СписокСотрудников КАК СписокСотрудников)
		|		И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
		|		ПО ВТ_СписокСотрудников.Сотрудник = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник
		|		И ВТ_СписокСотрудников.Регистратор = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВТ_ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ВТ_ОсновныеНачисления.Размер КАК Размер,
		|	ВТ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВТ_ОсновныеНачисления.ОсновныеНачисления КАК ОсновныеНачисления,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК ДополнительныеНачисления
		|ИЗ
		|	ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,, Сотрудник В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.Сотрудник КАК сотрудник
		|			ИЗ
		|				Вт_СписокСотрудников КАК СписокСотрудников)
		|		И ВидРасчета = &НДФЛ
		|		И ПериодРегистрации = &ПериодРегистрации) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыРасчета.ВКМ_Удержания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Выборка.НомерСтроки = Запись.НомерСтроки Тогда
				Запись.Результат = (Выборка.ОсновныеНачисления + Выборка.ДополнительныеНачисления) * (Выборка.Размер / 100);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
